#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастройкаВидимости();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВернутсяНаСкладПриИзменении(Элемент)
	НастройкаВидимости();
КонецПроцедуры

&НаКлиенте
Процедура МаршрутПоРеализациямПриИзменении(Элемент)
	НастройкаВидимости();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастройкаВидимости()
	Элементы.Склад.Видимость	= Объект.ВернутсяНаСклад;
	Элементы.Адрес.Видимость	= Объект.МаршрутПоРеализациям;
КонецПроцедуры

#КонецОбласти
