
&НаКлиенте
Процедура ВернутсяНаСкладПриИзменении(Элемент)
	НастройкаВидимости();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастройкаВидимости();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаВидимости()
	Элементы.Склад.Видимость = Объект.ВернутсяНаСклад;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры
