
&НаКлиенте
Перем Соединение;

&НаКлиенте
Процедура ПоказатьРезультатыПланирования(Команда)
	
	Если НЕ Элементы.Список.ТекущиеДанные = Неопределено Тогда  
		idПланирования = Элементы.Список.ТекущиеДанные.id;
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("idПланирования", idПланирования);
		ОткрытьФорму("Обработка.Yandex.Форма.Форма", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.id Тогда
		СтандартнаяОбработка = Ложь;
		ЗадачаID = Элементы.Список.ТекущиеДанные.id;
		СсылкаНаСервис = Настройки.АдресПросмотраРезультатов + Строка(ЗадачаID);
		ЗапуститьПриложение(СсылкаНаСервис);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Настройки = ЯМ_РаботаСНастройками.ПолучитьНастройкиМодуля();
	
КонецПроцедуры
