
Функция ПолучитьНастройкиМодуля() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЯМ_Настройки.Имя КАК Наименование,
	|	ЯМ_Настройки.Значение КАК Значение
	|ИЗ
	|	Справочник.ЯМ_Настройки КАК ЯМ_Настройки
	|ГДЕ
	|	НЕ ЯМ_Настройки.ПометкаУдаления
	|	И НЕ ЯМ_Настройки.ЭтоГруппа";
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураНастроек = Новый Структура;
	Пока Выборка.Следующий() Цикл 
		СтруктураНастроек.Вставить(Выборка.Наименование, Выборка.Значение);	
	КонецЦикла;	
	
	Возврат СтруктураНастроек;
	
КонецФункции
