&НаСервере
Процедура СохранитьДанныеРежимаРаботы()
	
	Если Не ЗначениеЗаполнено(ЯМ_РежимРаботы) Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
	ИмяКлючОбъекта(),
	ИмяКлючНастроек(),
	Новый Соответствие);
	
	ДанныеРежимРаботы = Новый Структура;
	Настройки.Вставить(ЯМ_РежимРаботы, ДанныеРежимРаботы);
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
	ИмяКлючОбъекта(),
	ИмяКлючНастроек(),
	Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЯМ_КомандаОКПеред(Команда)
	Если ЗначениеЗаполнено(ЯМ_РежимРаботы) Тогда
		СохранитьДанныеРежимаРаботы();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЯМ_ПриЗакрытииВместо(ЗавершениеРаботы)
	Если ПеренестиВДокумент И Модифицированность Тогда
		СтруктураРезультат = Новый Структура("
			|Грузоотправитель,Грузополучатель, ПеревозкаАвтотранспортом,
			|АдресДоставки, Перевозчик, МаркаАвтомобиля, РегистрационныйЗнакАвтомобиля,
			|МаркаПрицепа, РегистрационныйЗнакПрицепа,
			|СведенияОТранспортировкеИГрузе,ЯМ_РежимРаботы,
			|Водитель, ВодительскоеУдостоверение, КраткоеНаименованиеГруза, СопроводительныеДокументы");
		
		ЗаполнитьЗначенияСвойств(СтруктураРезультат, ЭтаФорма);
		
		Если ГрузоотправительОнЖе = 1 Тогда
			СтруктураРезультат.Грузоотправитель = Неопределено;
		КонецЕсли;

		Если ГрузополучательОнЖе = 1 Тогда
			СтруктураРезультат.Грузополучатель = Неопределено;
		КонецЕсли;
		
		Если ПеревозчикОнЖе = 1 Тогда
			СтруктураРезультат.Перевозчик = Неопределено;
		КонецЕсли;
		
		ОповеститьОВыборе(СтруктураРезультат);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЯМ_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	// Заполним реквизиты формы из параметров.
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры,
		"Организация, Контрагент, Грузоотправитель, Грузополучатель,
		|АдресДоставки, ДатаДокумента,СведенияОТранспортировкеИГрузе,
		|ПеревозкаАвтотранспортом,СпособДоставки,
		|Перевозчик, МаркаАвтомобиля, РегистрационныйЗнакАвтомобиля,
		|МаркаПрицепа, РегистрационныйЗнакПрицепа,ЯМ_РежимРаботы,
		|Водитель, ВодительскоеУдостоверение, КраткоеНаименованиеГруза, СопроводительныеДокументы
		|");
	
	ПолноеНаименованиеКонтрагента = "";
	СсылкаДляПереходаНаКарту = УправлениеКонтактнойИнформациейБП.СтрокаСсылкиПоказатьНаКарте();
	
	// Отобразим грузоотправителя и грузополучателя
	Если НЕ ЗначениеЗаполнено(Грузоотправитель) Тогда
		ГрузоотправительОнЖе = 1;
	Иначе
		ГрузоотправительОнЖе = 0;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Грузополучатель) Тогда
		ГрузополучательОнЖе = 1;
	Иначе
		ГрузополучательОнЖе = 0;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Перевозчик) Тогда
		ПеревозчикОнЖе = 1;
	Иначе
		ПеревозчикОнЖе = 0;
	КонецЕсли;
	
	// Если самовывоз или доставка собственными силами - можно выбрать перевозчика, так как он не задан в виде отгрузки
	Элементы.ГруппаПеревозчик.Доступность  = НЕ ЗначениеЗаполнено(СпособДоставки) 
		ИЛИ ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СпособДоставки, "ИмяПредопределенныхДанных"));
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ТекстГрузоотправительОнЖе = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "Наименование");
	Иначе
		ТекстГрузоотправительОнЖе = НСтр("ru = 'Организация'");
	КонецЕсли;
	Элементы.ГрузоотправительОнЖе1.СписокВыбора[0].Представление = ТекстГрузоотправительОнЖе;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ТекстПеревозчикОнЖе = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "Наименование");
	Иначе
		ТекстПеревозчикОнЖе = НСтр("ru = 'Организация'");
	КонецЕсли;
	Элементы.ПеревозчикОнЖе1.СписокВыбора[0].Представление = ТекстПеревозчикОнЖе;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		РеквизитыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Контрагент, "Наименование, НаименованиеПолное");
	
		ТекстГрузополучательОнЖе = РеквизитыКонтрагента.Наименование;
		
		Если ЗначениеЗаполнено(РеквизитыКонтрагента.НаименованиеПолное) Тогда
			ПолноеНаименованиеКонтрагента = РеквизитыКонтрагента.НаименованиеПолное;
		Иначе
			НаименованиеКонтрагента = РеквизитыКонтрагента.Наименование;
		КонецЕсли;
	Иначе
		ТекстГрузополучательОнЖе = НСтр("ru = 'Контрагент'");
	КонецЕсли;
	Элементы.ГрузополучательОнЖе1.СписокВыбора[0].Представление = ТекстГрузополучательОнЖе;
	
	
	ИспользоватьАдресДоставки = НЕ ПолучитьФункциональнуюОпцию("ИспользоватьДоставкуТранспортнойКомпанией") 
		ИЛИ НЕ ЗначениеЗаполнено(СпособДоставки);
		
	Элементы.ГруппаАдресДоставки.Видимость = ИспользоватьАдресДоставки;
	Если ИспользоватьАдресДоставки Тогда
		// Заполним списки выбора адреса доставки и доверенности значениями по умолчанию
		РеализацияТоваровУслугФормы.ЗаполнитьСписокАдресовДоставки(ЭтаФорма, Контрагент, Грузополучатель, ДатаДокумента);
	КонецЕсли; 
	
	
	ИспользоватьДоставкуАвтотранспортом = ПолучитьФункциональнуюОпцию("ИспользоватьДоставкуАвтотранспортом");
	Элементы.ПеревозкаАвтотранспортом.Видимость = ИспользоватьДоставкуАвтотранспортом;
	Элементы.ГруппаПеревозкаАвтотранспортом.Видимость = ИспользоватьДоставкуАвтотранспортом;
	
	ЕстьПравоНаПросмотрТранспортныхСредств = ПравоДоступа("Просмотр", Метаданные.Справочники.ТранспортныеСредства);
	Если Не ЕстьПравоНаПросмотрТранспортныхСредств Тогда
		Элементы.Марка.КнопкаВыбора = Ложь;
		Элементы.Марка.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	КонецЕсли;
	
	УстановитьЗаголовокГруппыПрицеп(ЭтотОбъект);
	
	УправлениеФормой(ЭтаФорма);
	
	// ИнтернетПоддержкаПользователей.Новости.КонтекстныеНовости_ПриСозданииНаСервере
	ИдентификаторыСобытийПриОткрытии = "ПриОткрытии";
	ОбработкаНовостейПереопределяемый.КонтекстныеНовости_ПриСозданииНаСервере(
		ЭтаФорма,
		"БП.Документ.РеализацияТоваровУслуг",
		"ФормаРеквизитыОрганизацииКонтрагентаТовары",
		НСтр("ru='Новости: Реализация (акт, накладная, УПД)'"),
		ИдентификаторыСобытийПриОткрытии
	);
	// Конец ИнтернетПоддержкаПользователей.Новости.КонтекстныеНовости_ПриСозданииНаСервере
КонецПроцедуры
