
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтоНовый = Объект.Ссылка.Пустая();
	
	Если ЭтоНовый Тогда
		Объект.СтоимостьКМ   = 8;
		Объект.СтоимостьЧас  = 100;
		Объект.СтоимостьФикс = 3000;
		Объект.КоличествоРейсов = 1;
		Объект.КорректировкаВремениДвиженияАвтомобиля = 1;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Смены.Количество() = 0 Тогда 
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "У машины должна быть создана хотя бы одна смена!";
		Сообщение.Поле = Элементы.Смены;
		Сообщение.Сообщить();
	КонецЕсли;	
	
	Если ПроверитьДубли() Тогда 
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "У машины должен быть уникальный логин курьера!";
		Сообщение.Поле = Элементы.ЛогинКурьера;
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если Объект.СтартНеНаСкладе Тогда 
		Если НЕ ЗначениеЗаполнено(Объект.ШиротаТочкиСтарта) Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "При включенной настройке Старт не на складе поле 
			|Широта точки старта должно быть заполнено!";
			Сообщение.Поле = Элементы.ШиротаТочкиСтарта;
			Сообщение.Сообщить();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ДолготаТочкиСтарта) Тогда 
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "При включенной настройке Старт не на складе поле 
			|Долгота точки старта должно быть заполнено!";
			Сообщение.Поле = Элементы.ДолготаТочкиСтарта;
			Сообщение.Сообщить();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ВременноеОкноТочкаСтарта) Тогда 
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "При включенной настройке Старт не на складе поле 
			|Временное окно точки старта должно быть заполнено!";
			Сообщение.Поле = Элементы.ВременноеОкноТочкаСтарта;
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;

	Если Объект.ЗавершениеНеНаСкладе Тогда 
		Если НЕ ЗначениеЗаполнено(Объект.ШиротаТочкиЗавершения) Тогда 
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "При включенной настройке Завершение не на складе поле 
			|Широта точки завершения должно быть заполнено!";
			Сообщение.Поле = Элементы.ШиротаТочкиСтарта;
			Сообщение.Сообщить();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ДолготаТочкиЗавершения) Тогда 
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "При включенной настройке Завершение не на складе поле 
			|Долгота точки завершения должно быть заполнено!";
			Сообщение.Поле = Элементы.ДолготаТочкиСтарта;
			Сообщение.Сообщить();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ВременноеОкноТочкаОкончания) Тогда 
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "При включенной настройке Завершение не на складе поле 
			|Временное окно точки завершения должно быть заполнено!";
			Сообщение.Поле = Элементы.ВременноеОкноТочкаСтарта;
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьДубли()
	
	ДублиЕсть = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЯМ_ТранспортныеСредства.ЛогинКурьера КАК ЛогинКурьера
	|ИЗ
	|	Справочник.ЯМ_ТранспортныеСредства КАК ЯМ_ТранспортныеСредства
	|ГДЕ
	|	НЕ ЯМ_ТранспортныеСредства.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Если ВРег(Выборка.ЛогинКурьера) = ВРег(Объект.ЛогинКурьера) Тогда 
			ДублиЕсть = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ДублиЕсть;
	
КонецФункции

&НаКлиенте
Процедура СтартНеНаСкладеПриИзменении(Элемент)
	
	ОбновитьОформлениеПолейТочкиСтарта();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеНеНаСкладеПриИзменении(Элемент)
	ОбновитьОформлениеПолейТочкиЗавершения();
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьОформлениеПолейТочкиСтарта()
	
	СтартНеНаСкладе = Объект.СтартНеНаСкладе;
	Элементы.ШиротаТочкиСтарта.ОтметкаНезаполненного 		= СтартНеНаСкладе И 
																НЕ ЗначениеЗаполнено(Объект.ШиротаТочкиСтарта);
	Элементы.ДолготаТочкиСтарта.ОтметкаНезаполненного 		= СтартНеНаСкладе И 
																НЕ ЗначениеЗаполнено(Объект.ДолготаТочкиСтарта);
	Элементы.ВременноеОкноТочкаСтарта.ОтметкаНезаполненного = СтартНеНаСкладе И 
																НЕ ЗначениеЗаполнено(Объект.ВременноеОкноТочкаСтарта);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОформлениеПолейТочкиЗавершения()

	ЗаврешениеНеНаСкладе = Объект.ЗавершениеНеНаСкладе;
	Элементы.ШиротаТочкиЗавершения.ОтметкаНезаполненного 		= ЗаврешениеНеНаСкладе И 
															НЕ ЗначениеЗаполнено(Объект.ШиротаТочкиЗавершения);
	Элементы.ДолготаТочкиЗавершения.ОтметкаНезаполненного 		= ЗаврешениеНеНаСкладе И 
															НЕ ЗначениеЗаполнено(Объект.ДолготаТочкиЗавершения);
	Элементы.ВременноеОкноТочкаОкончания.ОтметкаНезаполненного 	= ЗаврешениеНеНаСкладе И 
															НЕ ЗначениеЗаполнено(Объект.ВременноеОкноТочкаОкончания);
	
КонецПроцедуры