&НаКлиенте
Процедура ВвестиСкопированныеКоординаты(Команда)
	Координаты = "";
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив);
	Оповещение =
	Новый ОписаниеОповещения("ПослеВводаЗначения", ЭтотОбъект, Параметры);
	ПоказатьВводЗначения(Оповещение,
	Координаты, "Вставьте координаты скопированные в яндекс", ОписаниеТипов);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначения(Координаты, Параметры) Экспорт
	Координаты = СтрЗаменить(Координаты," ","");
	Если НЕ Координаты = "" Тогда
		КоординатыРазобранные = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Координаты,",",Истина,Истина);
		
		Объект.Широта = КоординатыРазобранные[0];
		Объект.Долгота = КоординатыРазобранные[1];
    КонецЕсли;
КонецПроцедуры