
&Вместо("ДоставкаНажатие")
Процедура ЯМ_ДоставкаНажатие(Форма, Элемент)
	Объект = Форма.Объект;
	
	Если НЕ Форма.ТолькоПросмотр Тогда
		Форма.ЗаблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ТолькоПросмотр",                 Форма.ТолькоПросмотр);
	ПараметрыФормы.Вставить("Организация",                    Объект.Организация);
	ПараметрыФормы.Вставить("Контрагент",                     Объект.Контрагент);
	ПараметрыФормы.Вставить("Грузоотправитель",               Объект.Грузоотправитель);
	ПараметрыФормы.Вставить("Грузополучатель",                Объект.Грузополучатель);
	ПараметрыФормы.Вставить("ДатаДокумента",                  Объект.Дата);
	ПараметрыФормы.Вставить("АдресДоставки",                  Объект.АдресДоставки);
	ПараметрыФормы.Вставить("Перевозчик",                     Объект.Перевозчик);
	ПараметрыФормы.Вставить("МаркаАвтомобиля",                Объект.МаркаАвтомобиля);
	ПараметрыФормы.Вставить("РегистрационныйЗнакАвтомобиля",  Объект.РегистрационныйЗнакАвтомобиля);
	ПараметрыФормы.Вставить("МаркаПрицепа",                   Объект.МаркаПрицепа);
	ПараметрыФормы.Вставить("РегистрационныйЗнакПрицепа",     Объект.РегистрационныйЗнакПрицепа);
	ПараметрыФормы.Вставить("Водитель",                       Объект.Водитель);
	ПараметрыФормы.Вставить("ВодительскоеУдостоверение",      Объект.ВодительскоеУдостоверение);
	ПараметрыФормы.Вставить("КраткоеНаименованиеГруза",       Объект.КраткоеНаименованиеГруза);
	ПараметрыФормы.Вставить("СопроводительныеДокументы",      Объект.СопроводительныеДокументы);
	ПараметрыФормы.Вставить("СведенияОТранспортировкеИГрузе", Объект.СведенияОТранспортировкеИГрузе);
	ПараметрыФормы.Вставить("ПеревозкаАвтотранспортом",       Объект.ПеревозкаАвтотранспортом);
	ПараметрыФормы.Вставить("ЯМ_РежимРаботы",       			Объект.ЯМ_РежимРаботы);
	ПараметрыФормы.Вставить("СпособДоставки",                 Объект.СпособДоставки);
	ОткрытьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаДоставка", ПараметрыФормы, Форма);
КонецПроцедуры
