
Функция ОпределитьКонфигурацию() Экспорт 
	
	СинонимКонф = Метаданные.Синоним;
	МассивКонфигураций = Новый Массив;
	
	// Формат: Массив из структуры - "Ключ" - имя конфигурации, "Значение" - сокращение
	МассивКонфигураций.Добавить(Новый Структура("Ключ, Значение", "Комплексная автоматизация", "КА"));
	МассивКонфигураций.Добавить(Новый Структура("Ключ, Значение", "Управление производственным предприятием", "УПП"));
	МассивКонфигураций.Добавить(Новый Структура("Ключ, Значение", "Ликероводочный и винный завод", "УПП"));
	МассивКонфигураций.Добавить(Новый Структура("Ключ, Значение", "Управление проектной организацией", "УПП"));
	МассивКонфигураций.Добавить(Новый Структура("Ключ, Значение", "1С: Спиртовое производство", "УПП"));
	МассивКонфигураций.Добавить(Новый Структура("Ключ, Значение", "1С:Молокозавод", "УПП"));
	МассивКонфигураций.Добавить(Новый Структура("Ключ, Значение", "1С:Подрядчик строительства", "УПП"));
	МассивКонфигураций.Добавить(Новый Структура("Ключ, Значение", "Бухгалтерия предприятия", "БП"));
	МассивКонфигураций.Добавить(Новый Структура("Ключ, Значение", "ERP", "УТ"));
	МассивКонфигураций.Добавить(Новый Структура("Ключ, Значение", "Управление аптечной сетью", "УТ"));
	МассивКонфигураций.Добавить(Новый Структура("Ключ, Значение", "Управление торговлей", "УТ"));
	МассивКонфигураций.Добавить(Новый Структура("Ключ, Значение", "Управление нашей фирмой", "УНФ"));
	МассивКонфигураций.Добавить(Новый Структура("Ключ, Значение", "Розница, редакция 2.3", "Розница"));
	МассивКонфигураций.Добавить(Новый Структура("Ключ, Значение", "БИТ.Управление медицинским центром", "БИТУМЦ"));
	
	ИмяКонф = "";
	
	Для Каждого Элемент Из МассивКонфигураций Цикл
		Если Найти(СинонимКонф, Элемент.Ключ) > 0 Тогда
			ИмяКонф = Элемент.Значение;
			Если Элемент.Ключ = "Управление торговлей" И Найти(СинонимКонф, "10.3") > 0 Тогда
				ИмяКонф = "УТ10";
			КонецЕсли;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИмяКонф;
	
КонецФункции


Функция ОбработатьВременноеОкно(ВременноеОкно) Экспорт 
	
	// 99:99-99:99	
	Окна		= СтрРазделить(ВременноеОкно, "-");
	ОкноНачало	= Окна[0];
	ОкноКонец	= Окна[1];
	
	ОкноНачало	= ОкноНачало + ":00";
	ОкноКонец	= ОкноКонец + ":00";
	
	Возврат ОкноНачало + "-" + ОкноКонец;
	
КонецФункции