
Функция ОпределитьКонфигурацию() Экспорт 
	
	СинонимКонф = Метаданные.Синоним;
	ИмяКонф = "";	
	Если Найти(СинонимКонф, "Комплексная автоматизация") > 0 Тогда
		ИмяКонф = "КА";	
	ИначеЕсли Найти(СинонимКонф,"Управление производственным предприятием") > 0
		ИЛИ Найти(СинонимКонф, "Ликероводочный и винный завод") > 0
		ИЛИ Найти(СинонимКонф, "Управление проектной организацией") > 0
		ИЛИ Найти(СинонимКонф, "1С: Спиртовое производство") > 0      
		ИЛИ Найти(СинонимКонф, "1С:Молокозавод")>0 
		ИЛИ Найти(СинонимКонф, "1С:Подрядчик строительства") > 0 Тогда
		ИмяКонф = "УПП";
	ИначеЕсли 	Найти(СинонимКонф,"Бухгалтерия предприятия") > 0 Тогда
		ИмяКонф = "БП";		
	ИначеЕсли Найти(СинонимКонф,"ERP") > 0 Тогда
		ИмяКонф = "УТ";
	ИначеЕсли Найти(СинонимКонф,"Управление торговлей") > 0 Тогда
		Если Найти(СинонимКонф,"10.3") > 0 Тогда 
			ИмяКонф = "УТ10";
		Иначе
			ИмяКонф = "УТ";
		КонецЕсли;
	ИначеЕсли Найти(СинонимКонф, "Управление нашей фирмой") > 0 Тогда 
		ИмяКонф = "УНФ";	
	ИначеЕсли Найти(СинонимКонф, "Розница, редакция 2.3") > 0 Тогда 
		ИмяКонф = "Розница";
	ИначеЕсли Найти(СинонимКонф, "БИТ.Управление медицинским центром") > 0 Тогда 
		ИмяКонф = "БИТУМЦ";
	КонецЕсли;
	
	Возврат ИмяКонф;
	
КонецФункции

Функция ОбработатьВременноеОкно(ВременноеОкно) Экспорт 
	
	// 99:99-99:99	
	Окна		= СтрРазделить(ВременноеОкно, "-");
	ОкноНачало	= Окна[0];
	ОкноКонец	= Окна[1];
	
	ОкноНачало	= ОкноНачало + ":00";
	ОкноКонец	= ОкноКонец + ":00";
	
	Возврат ОкноНачало + "-" + ОкноКонец;
	
КонецФункции