Функция ГеокодироватьАдрес(АдресДляГеокодирования, Настройки) Экспорт 
	СтруктураКоординаты = Новый Структура("Долгота, Широта, ТочностьГеокодирования");
	
	Если (НЕ Настройки.Свойство("ДолготаСклада") ИЛИ Настройки.ДолготаСклада = 0)
		ИЛИ (НЕ Настройки.Свойство("ШиротаСклада") ИЛИ Настройки.ШиротаСклада = 0) Тогда 
		Возврат СтруктураКоординаты;	
	ИначеЕсли (НЕ Настройки.Свойство("ОбластьПоискаДолгота") ИЛИ Настройки.ОбластьПоискаДолгота = 0)
		И (НЕ Настройки.Свойство("ОбластьПоискаШирота") ИЛИ Настройки.ОбластьПоискаШирота = 0) Тогда
		Возврат СтруктураКоординаты;	
	КонецЕсли;
	
	Ответ = ЯМ_ГеокодированиеСервер.ГеокодированиеНаСервере(АдресДляГеокодирования, Настройки);
	
	ЯМ_СлужебныйКлиент.ОбработатьКодСостоянияОтвета(Ответ.КодСостояния);
	
	Если Ответ.КодСостояния < 300 Тогда 
		Результат = Ответ.Результат;
			
		Если Результат.response.GeoObjectCollection.metaDataProperty.GeocoderResponseMetaData.found = "0" Тогда
			
			СтруктураКоординаты.Вставить("ТочностьГеокодирования", 9);
			СтруктураКоординаты.Вставить("АдресПоКоординатам", "");
			
		Иначе 		
//			НеобходимыУточненияАдресов = Ложь;
			Для Каждого НайденныйОбъект Из Результат.response.GeoObjectCollection.featureMember Цикл 
				МассивКоординат = СтрРазделить(НайденныйОбъект.GeoObject.Point.pos, " ");
				СтруктураКоординаты.Долгота = МассивКоординат[0];
				СтруктураКоординаты.Широта = МассивКоординат[1];
				ТочностьГеокодирования = 3;
				Если НайденныйОбъект.GeoObject.metaDataProperty.GeocoderMetaData.precision = "near" ИЛИ НайденныйОбъект.GeoObject.metaDataProperty.GeocoderMetaData.precision = "street" Тогда 
					ТочностьГеокодирования = 2;
				ИначеЕсли НайденныйОбъект.GeoObject.metaDataProperty.GeocoderMetaData.precision = "other" Тогда 
					ТочностьГеокодирования = 1;
				КонецЕсли;
//				Если ТочностьГеокодирования < 3 Тогда 
//					НеобходимыУточненияАдресов = Истина;
//				КонецЕсли;
				СтруктураКоординаты.Вставить("АдресПоКоординатам", НайденныйОбъект.GeoObject.metaDataProperty.GeocoderMetaData.text);
				СтруктураКоординаты.Вставить("ТочностьГеокодирования", ТочностьГеокодирования);
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураКоординаты;
	
КонецФункции

