
Процедура ОбработатьКодСостоянияОтвета(КодСостояния) Экспорт 
	
	Текст = "";
	
	// Ошибки 4XX говорят о неправильном запросе - в широком смысле
	// Может быть неправильный адрес, ошибка аутентификации, плохой формат запроса
	// Подробнее смотри http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html#sec10.4
	Если КодСостояния >= 400 и КодСостояния < 500  Тогда
		Текст = "Код статуса больше 4XX, ошибка запроса.  Код статуса: " + КодСостояния;
	КонецЕсли;
	
	// Ошибки 5XX говорят о проблемах на сервере (возможно, прокси-сервер)
	// Это может быть программная ошибка, нехватка памяти, ошибка конфигурации и т.д.
	// Подробнее смотри http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html#sec10.5
	Если КодСостояния >= 500 и КодСостояния < 600  Тогда
		Текст = "Код статуса больше 5XX, ошибка сервера. Код статуса: " + КодСостояния;
	КонецЕсли;
	
	// Обрабатываем перенаправление
	Если КодСостояния >= 300 и КодСостояния < 400  Тогда
		Текст = "Код статуса больше 3XX, Перенаправление. Код статуса: " + КодСостояния;
		Если КодСостояния = 302 Тогда
			Текст = "Код статуса 302, Постоянное перенаправление";
		КонецЕсли;
	КонецЕсли;	
	
	Если НЕ Текст = "" Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = Текст;
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры
