
&НаКлиенте
Процедура ЯМ_КонтрагентПриИзмененииПосле(Элемент)
	Объект.ЯМ_РежимРаботы = ПолучитьРежимРаботы();
КонецПроцедуры

&НаСервере
Функция ПолучитьРежимРаботы()
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Контрагенты.ЯМ_РежимРаботы КАК ЯМ_РежимРаботы
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка",Объект.Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ЯМ_РежимРаботы;
	КонецЕсли;
	
	Возврат "";
КонецФункции