Функция ГеокодированиеНаСервере(АдресДляГеокодирования, Настройки) Экспорт
	// параметры подключения
	Ключ = Настройки.КлючAPI_Геокодирование;
	Сервер = Настройки.АдресСервисаГеокодирование;
	
	ссл = Новый ЗащищенноеСоединениеOpenSSL();
	Соединение = Новый HTTPСоединение(Сервер,,,,,,ссл);
	
	ЗапросКлюч = "?apikey=" + Ключ;
	ЗапросФормат = "&format=json";
	ЗапросКоличествоРезультатов = "&results=1";
	ЗапросАдрес = "&geocode=" + АдресДляГеокодирования;
	ЗапросОбласть = "&bbox=" + СтрЗаменить(Строка(Настройки.ДолготаСклада - Настройки.ОбластьПоискаДолгота/2),",",".") + "," + СтрЗаменить(Строка(Настройки.ШиротаСклада - Настройки.ОбластьПоискаШирота/2),",",".") 
		+ "~" + СтрЗаменить(Строка(Настройки.ДолготаСклада + Настройки.ОбластьПоискаДолгота/2),",",".") + "," + СтрЗаменить(Строка(Настройки.ШиротаСклада + Настройки.ОбластьПоискаШирота/2),",",".");
	
	Запрос = Новый HTTPЗапрос("/1.x/" + ЗапросКлюч + ЗапросФормат + ЗапросКоличествоРезультатов + ЗапросАдрес + ЗапросОбласть);
	
	Ответ = Соединение.Получить(Запрос);
	
	Чтение = Новый ЧтениеJSON;
	ОтветСтрокой = Ответ.ПолучитьТелоКакСтроку(); 
	Чтение.УстановитьСтроку(ОтветСтрокой);
	Результат = ПрочитатьJSON(Чтение);
	
	СтруктураВозврата = Новый Структура("КодСостояния,Результат");
	СтруктураВозврата.КодСостояния = Ответ.КодСостояния;
	СтруктураВозврата.Результат = Результат;
	
	Возврат СтруктураВозврата;
КонецФункции